## Initialize dataframes

In [2]:
from Startup import *

finished standard imports
started SparkContext and SQLContext
loaded weather.parquet in 8.24 seconds
loaded stations.parquet in 0.18 seconds
registered dataframes as tables in 0.24 seconds

In [3]:
%%time
print('df has %d rows, stations has %d rows'%(df.count(),stations.count()))

df has 9358394 rows, stations has 85284 rows
CPU times: user 0 ns, sys: 0 ns, total: 0 ns
Wall time: 10.2 s

### Counting the number of stations in each country

The country index is the first two letters of the station ID.

In [4]:
stations.show(3)

+-----------+--------+---------+---------+-----+-------------+-------+-------+-----+
|         ID|latitude|longitude|elevation|state|         name|GSNFLAG|HCNFLAG|WMOID|
+-----------+--------+---------+---------+-----+-------------+-------+-------+-----+
|US1COLR0185|  40.711|-105.1144|   1599.0|   CO|WELLINGTON 5.|       |       |     |
|US1COLR0186| 40.8135|-105.0963|   1601.7|   CO|BUCKEYE 0.9 S|       |       |     |
|US1COLR0187| 40.7689| -105.064|   1653.8|   CO|WELLINGTON 5.|       |       |     |
+-----------+--------+---------+---------+-----+-------------+-------+-------+-----+
only showing top 3 rows

In [5]:
st_names=stations.select('ID').collect()

In [6]:
len(st_names)

85284

In [7]:
st_names1=[r.ID for r in st_names]

In [8]:
st_names1[-5:]

[u'US1COLR0171',
 u'US1COLR0172',
 u'US1COLR0173',
 u'US1COLR0181',
 u'US1COLR0183']

In [9]:
from collections import Counter

In [10]:
C=Counter([x[:2] for x in st_names1])

In [11]:
sorted_prefix=sorted(C.items(),key=lambda x:x[1],reverse=True)

In [12]:
len(sorted_prefix)

180

In [13]:
sorted_prefix[:10]

[(u'US', 46051),
 (u'AS', 17081),
 (u'BR', 5935),
 (u'CA', 5286),
 (u'IN', 3805),
 (u'SF', 1154),
 (u'RS', 1099),
 (u'NO', 419),
 (u'NL', 359),
 (u'KZ', 328)]

## Excercises

1. Count the total number of yearXstationXmeasurement  Records (YSMRs) for each country. **done below**
2. Count the number of YSMR's for each measurement. Was done in the notebook: "What are the most common measurements?"
3. Compute the mean P/M std of TOBS for each country and each state. "will be done in the notebook: global analysis of TOBS

In [35]:
#doing it in two steps, because I could not figure out how to do it in one step.

query1="""
SELECT SUBSTRING(Station, 1, 2) as country
FROM weather  
"""
country=sqlContext.sql(query1)
sqlContext.registerDataFrameAsTable(country,'country_tbl')
query2="""
select country,count(country) as count
FROM country_tbl
GROUP BY country 
ORDER BY count
"""
countryCounts=sqlContext.sql(query2).toPandas()

In [38]:
countryCounts.tail(20) #.iloc[-1:-1:0,1:3]

    country    count
160      TH     7936
161      SW     7995
162      FR     9639
163      SP    18827
164      GM    25484
165      UP    27315
166      MX    28636
167      RQ    29849
168      KZ    30123
169      JA    34763
170      CH    35120
171      NL    38782
172      NO    49767
173      SF    97293
174      IN   176655
175      BR   180512
176      RS   200175
177      CA   461508
178      AS  1377463
179      US  6308481